#include <iostream>

using namespace std;

/*
 * - PART 3 -
 * Для программы, рассмотренной в качестве примера, добавить в иерархию ещё один класс, описывающий трапецию
 * Составьте программу, в которой с помощью класса вычисляется периметр фигуры, заданной множеством точек. точки могут быть заданы как на плоскости, так и в пространстве
 * Составить программу, описывающую библиотечную картотеку, в которой с помощью иерархии классов с базовым абстрактным классом формируется элемент картотеки.
 *   Программа осуществляет сортировку, внесение и вывод данных картотеки, а также ввод и вывод одиночной записи. Запись в картотеке содержит: Автор, название, тип, издательство, год, кол-во страниц
 * - PART 4 -
 * Создать диаграмму классов для картотеки, рассмотренной в предыдущем задании
 * Создать программу с использованием всех видов связей для решения задачи определения отношений двух прямых в пространстве, заданных двумя точками для каждой прямой.
 *   Для случая пересечения вычислить точку пересечения, для случая параллельности вычислть расстояние между прямыми, для скрещивания вычислить минимальное расстояние и уравнение перпендикуляра
 *
*/

int main()
{
    cout << "Hello World!" << endl;
    return 0;
}
